mixin MockHelpSection {
  static const descriptionText = '''
Все студенты, нуждающиеся в жилье, будут размещены в одном из трех общежитий. Здания общежитий расположены рядом с учебными корпусами. Общая площадь общежитий составляет 18819,9 кв.

Вместительность до 821 студентов.

Жилая площадь на одного человека — 6,6 кв.м

Каждая комната в общежитии рассчитана на 2-3 человека и оборудована кроватями, прикроватными тумбами, пуфиками, шкафами и холодильником.

В каждом здании общежития есть кухня, комнаты отдыха, спортивные комнаты, душевые и прачечные, оснащенные современной техникой — стиральными и сушильными машинами, гладильными досками и утюгами.

Во всех общежитиях есть Wi-Fi интернет. Комнаты отдыха оснащены плазменными телевизорами со спутниковым и местным телевидением.Для обеспечения безопасности всех жителей, общежитие круглосуточно охраняется
  ''';

  static const checkInProcedureHeader = '''
Процедура заселения в общежитие для граждан Казахстана, проживающих вне Алматы
  ''';

  static const checkInProcedureBody = '''
Подать документы на поступление 

Выбрать тип проживания (2,3,4-х местное проживание) и сообщить менеджеру Приемной комиссии.

Оплатить депозит за 10 месяцев проживания (в случае отказа от проживания, сумма неиспользованных месяцев проживания возвращается студенту)

Получить ордер на заселение (по электронной почте и распечатанный ордер, по прибытии в университет)

На основании ордера о заселении университет проводит процедуру регистрации по месту проживания студента.
  ''';

  static const foreignCitizensText = 
  '''
Подать документы на поступление (подробная информация про поступление)

Выбрать тип проживания (2,3,4-х местное проживание) и сообщить менеджеру Приемной комиссии.

Оплатить депозит за 10 месяцев проживания (в случае отказа от проживания, сумма неиспользованных месяцев проживания возвращается студенту)

Получить ордер на заселение (по электронной почте и распечатанный ордер, по прибытии в университет)

В день заселения в общежитие, посетить медпункт для сдачи крови на ВИЧ/СПИД и получения мед. справки на заселение в общежитие

На основании ордера о заселении университет проводит процедуру регистрации по месту проживания студента.

Примечание:

иностранные студенты обязаны предоставить справку 086-У и снимок флюорографии, сделанные на территории Республики Казахстан.

иностранные граждане, прибывшие из стран с безвизовым режимом самостоятельно, планирующие остаться в стране для получения обучения должны быть зарегистрированы в общежитии, если они планируют проживать в общежитии университета (Например, если вы приехали до начала учебы и решили погостить у родственников,но будете жить в общежитии, то важно заранее позаботиться о том, чтобы вы были зарегистрированы в общежитии университета, а не у родственников)
  ''';
}
